tap "bufbuild/buf"
tap "terrastruct/tap"
tap "hashicorp/tap"
tap "homeport/tap"
tap "azure/kubelogin"

cask "raycast"
cask "betterdisplay"
brew "oath-toolkit"

brew "fish"
brew "fzf"

brew "git"
brew "gh"
brew "jj"

brew "neovim"
brew "go"
brew "node"

brew "coreutils"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "wget"
brew "direnv"
brew "duckdb"
brew "ruff"
brew "uv"
brew "glow"
brew "homeport/tap/dyff"
cask "gcloud-cli"
brew "hashicorp/tap/terraform"
brew "bufbuild/buf/buf"
brew "crane"
brew "flyctl"
brew "hashicorp/tap/vault"
brew "helm"
brew "temporal"
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "yamllint"
brew "helm-ls"
brew "argocd"
cask "claude-code"
brew "graphviz"
