require "socket"
work_machine = Socket.gethostname == "PEO-M1P-BH.local"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "bufbuild/buf"

# cask "google-chrome", force: true unless work_machine
cask "firefox", force: true
cask "1password"
cask "raycast"
cask "hammerspoon"
cask "betterdisplay"
brew "mas"

cask "obsidian"
mas "Muse", id: 1501563902
mas "Things 3", id: 904280696 if work_machine
cask "kitty"
brew "fish"
brew "tmux"
brew "fzf"

brew "git"
brew "gh"
brew "git-delta"

brew "neovim"
brew "asdf"
brew "pipx"
brew "go"

brew "coreutils"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "wget"

cask "google-cloud-sdk"
brew "terraform"
brew "bufbuild/buf/buf"

# ruby build env deps
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"

# erlang build env deps
brew "autoconf"
brew "openssl@1.1"


cask "visual-studio-code"
