tap "bufbuild/buf"
tap "1password/tap"
tap "terrastruct/tap"
tap "hashicorp/tap"
tap "pulumi/tap"
tap "dagger/tap"
tap "CtrlSpice/homebrew-otel-desktop-viewer"
tap "homeport/tap"

cask "1password"
cask "raycast"
cask "hammerspoon"
cask "betterdisplay"
brew "mas"
cask "1password-cli"
brew "oath-toolkit"
brew "otel-desktop-viewer"

brew "fish"
brew "tmux"
brew "fzf"

brew "git"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "jj"

brew "neovim"
brew "asdf"
brew "go"

brew "coreutils"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "wget"
brew "d2"
brew "tala"
brew "direnv"
brew "duckdb"
brew "ruff"
brew "uv"
brew "glow"
brew "d2"
brew "homeport/tap/dyff"

cask "google-cloud-sdk"
brew "terraform"
brew "bufbuild/buf/buf"
brew "crane"
brew "flyctl"
brew "hashicorp/tap/vault"
brew "pulumi/tap/pulumi"
brew "dagger/tap/dagger"

# ruby build env deps
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"

# erlang build env deps
brew "autoconf"
brew "openssl@1.1"
